SigninLogs 
| where TimeGenerated > ago(90d) 
| where AppId == '00000002-0000-0ff1-ce00-000000000000' and (UserPrincipalName !contains '.rm' and UserPrincipalName !contains '.room')
| where (ResultType == 0) and ConditionalAccessStatus == 'notApplied'
| distinct UserPrincipalName,IPAddress
